app/controllers/items_controller.rb

    def index
        @item = Item.all
---
SELECT "items".* FROM "items"

    def create
        @item = Item.new(item_params)

        if (@item.save)
---
INSERT INTO "items" ("serial_num", "description", "supplier", "status", "lender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"